{
    "CONFIGS": [
        "The list of registered configurations."
    ],
    "CONFIG_COMMENTS": [
        "A user-provided description of the configuration."
    ],
    "CONFIG_ID": [
        "An internally-generated unique identifier of the configuration."
    ],
    "DATA_SOURCE": [
        "A label identifying the provenance of the record. FIXME: An example of differences.",
        "A label identifying the provenance of the record."
    ],
    "DATA_SOURCES": [
        "The list of registered data sources."
    ],
    "DSRC_CODE": [
        "The unique text identifier of the datasource. It should be UPPER_CASE ASCII without spaces. It will be used as a JSON key."
    ],
    "DSRC_ID": [
        "The unique internal integer identifier of the datasource."
    ],
    "ELEMENTS": [
        "Internal use."
    ],
    "ENTITY_ID": [
        "The ENTITY_ID is the Senzing-generated identifier for the discovered entity. It may change when new information is added."
    ],
    "ENTITY_NAME": [
        "A name this entity goes by. An entity could have multiple names."
    ],
    "ERRULE_CODE": [
        "Identifier of the entity resolution rule that was triggered."
    ],
    "FEAT_DESC": [
        "Describes the attributes that make up the feature."
    ],
    "FEAT_DESC_VALUES": [
        "Describes the attributes that make up the feature."
    ],
    "FELEM_CODE": [
        "Internal use."
    ],
    "FELEM_VALUE": [
        "Internal use."
    ],
    "FTYPE_CODE": [
        "Internal use."
    ],
    "INTERNAL_ID": [
        "Internal identifier for the record."
    ],
    "INTERNAL_ID_2": [
        "Internal identifier for the record."
    ],
    "IS_AMBIGUOUS": [
        "Indicates if this is an ambiguous relationship."
    ],
    "IS_DISCLOSED": [
        "Indicates if this is a disclosed relationship."
    ],
    "LIB_FEAT_ID": [
        "Internal use."
    ],
    "MATCH_KEY": [
        "Representation of matched source record features."
    ],
    "MATCH_LEVEL_CODE": [
        "The type of match that occurred for the record."
    ],
    "RECORDS": [
        "A list of (data source code, record id) pairs."
    ],
    "RECORD_COUNT": [
        "The number of records for the entity with the same data source code."
    ],
    "RECORD_ID": [
        "The unique identifier within the set of records in the DATA_SOURCE."
    ],
    "RECORD_SUMMARY": [
        "Overview of the source systems the records came from comprising this related entity."
    ],
    "SYS_CREATE_DT": [
        "The timestamp of the original registration of the configuration."
    ],
    "USAGE_TYPE": [
        "Label to identify how some features are being used (can also change some features behavior)."
    ],
    "dataStores": [
        "A list of database node connection metadata."
    ],
    "id": [
        "Label for database repository."
    ],
    "insertTime": [
        "The duration of the test in milliseconds."
    ],
    "location": [
        "Database connection information."
    ],
    "numRecordsInserted": [
        "The total number of records inserted within the insertTime."
    ],
    "type": [
        "Type of database."
    ]
}